<!--
  - Copyright (c) 2022. TalexDreamSoul
  -
  - Licensed under the Apache License, Version 2.0 (the "License");
  - you may not use this file except in compliance with the License.
  - You may obtain a copy of the License at
  -
  -     http://www.apache.org/licenses/LICENSE-2.0
  -
  - Unless required by applicable law or agreed to in writing, software
  - distributed under the License is distributed on an "AS IS" BASIS,
  - WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  - See the License for the specific language governing permissions and
  - limitations under the License.
  -->

<template>
  <div class="About-Container LayoutSub-Frame">
    <h3 style="text-align: center">TalexWiki 隐私政策</h3>
    <blockquote>
      当您使用 TalexWiki 或 购买带 <span class="premium-normal">PRO</span> 标记的产品时 即代表您遵循以下协议：
    </blockquote>
    <div class="about-agreement-time">
      <span class="time">更新日期：2022年【09】月【07】日</span>

      <span class="time">生效日期：2022年【09】月【07】日</span>
    </div>

    <span>
      “TalexWiki”及相关服务，系指由TalexDreamSoul（QQ2418876761、GITHUB同名）（以下简称“我们”）个人独立完成的合法拥有并运营的、标注名称为“TalexWiki”的网页端应用程序。我们作为TalexWiki的运营者，深知个人信息对您的重要性，您的信任对我们非常重要，我们将按照法律法规的规定并参照行业最佳实践保护您的个人信息及隐私安全。我们制定本"隐私政策"并特别提示：希望您在使用TalexWiki及相关服务前仔细阅读并理解本隐私政策，以便做出适当的选择。

      <h4>本隐私政策将帮助您了解：</h4>

      我们会遵循隐私政策收集、使用您的信息，但不会仅因您同意本隐私政策而采用强制捆绑的方式一揽子收集个人信息。
      当您使用或开启相关功能或使用服务时，为实现功能、服务所必需，我们会收集、使用相关信息。除非是为实现基本业务功能或根据法律法规要求所必需的必要信息，您均可以拒绝提供且不影响其他功能或服务。我们将在隐私政策中逐项说明哪些是必要信息。
      如果您未登录帐号，我们会通过设备对应的标识符信息来保障信息推送的基本功能。如果您登录了帐号，我们会根据帐号信息实现信息推送。
      IP位置（精确定位）、摄像头（拍照）权限，均不会默认开启，只有经过您的明示授权才会在为实现特定功能或服务时使用，您也可以撤回授权。 特别需要指出的是，即使经过您的授权，我们获得了这些敏感权限，也不会在相关功能或服务不需要时而收集您的信息。

      <br />
      <br />

      本隐私政策适用于您通过TalexWiki网页（wiki.talex.cn）来访问和使用我们的产品和服务。如您使用我们或关联公司向您提供的某项或某几项服务，有其单独的隐私政策的，则相应服务或产品适用相应隐私政策；如未设立独立隐私政策的，则本政策同样适用于该部分产品或服务。
      下文将帮您详细了解我们如何收集、使用、存储、传输、共享、转移（如适用）与保护个人信息；帮您了解查阅、复制、删除、更正、撤回授权个人信息的方式。本政策与您使用我们的服务关系密切，我们建议您仔细阅读并理解本政策全部内容，作出您认为适当的选择，其中， 有关您个人信息权益的条款重要内容我们已用<b>加粗</b>形式提示，请特别关注。

    </span>

    <div class="main-agreement-content">
      <pre class="agreement-main-content-content">
        我们如何收集和使用个人信息
        我们如何使用cookie等同类技术
        数据使用过程中涉及的合作方以及转移、公开个人信息
        我们如何存储个人信息
        我们如何保护个人信息的安全
        个性化推荐
        管理您的个人信息
        未成年人使用条款
        隐私政策的修订和通知
        联系我们
      </pre>

      <!--      1.0-->
      <div>
        <h4>1. 我们如何收集和使用个人信息</h4>

        <blockquote>我们会按照如下方式收集您在使用服务时主动提供的，以及通过自动化手段收集您在使用功能或接受服务过程中产生的信息：</blockquote>

        <h5>1.1 注册、登录</h5>
        <ul>
          <li>a. 当您注册、登录TalexWiki及相关服务时，您可以通过手机号创建帐号，并且您可以完善相关的网络身份识别信息（头像、昵称、密码），收集这些信息是为了帮助您完成注册。手机号码是履行国家法律法规关于网络实名制要求的必要信息，如果您不提供手机号码用于注册、登录，我们可能无法为您提供信息发布、评论等功能。您注册、登录账号后可以填写个人资料（简介、性别）来完善您的信息。我们将会收集您主动填写的个人资料用于向其他用户展示，以及向您提供推荐内容。</li>
          <li>b. 基于我们与通信运营商的合作，当您使用TalexWiki"一键登录"功能时，经过您的同意，我们会与运营商处理您的手机号码，以便于为您提供快捷的登录服务。如果拒绝上述处理，将无法使用"一键登录"方式注册登录TalexWiki，但不影响您通过其他方式注册登录，也不影响其他功能的正常使用。</li>
          <li>c. 您也可以使用第三方帐号登录并使用TalexWiki，您将授权我们获取您在第三方平台注册的公开信息（头像、昵称以及您授权的其他信息），用于与TalexWiki帐号绑定，使您可以直接登录并使用本产品和相关服务。</li>
          <li>d. 通过 邀请制度 获得的账号也可以直接登录 TalexWiki ，但必须在您完成手机号验证后继续。</li>
        </ul>

        <h5>1.2 内容浏览</h5>
        <blockquote>TalexWiki可能会根据您在TalexWiki内订阅的标签、话题和关注的用户，向您推荐更感兴趣的信息，为实现这一功能，我们可能会收集必要的日志信息，我们不会使用来源于第三方的数据以实现上述功能。</blockquote>

        <h5>1.3 发布与互动</h5>

        <h6>1.3.1 信息发布</h6>
        <ul>
          <li>a. 您发布内容、评论、提问或回答时，我们将收集您发布的信息，并展示您的昵称、头像、发布内容。</li>
          <li>b. 您使用上传图片或者更换头像功能时，我们会请求您授权存储空间、摄像头权限。您如果拒绝授权提供，将无法使用此功能，但不影响您正常使用TalexWiki的其他功能。</li>
          <li>c. 用户因使用我们的产品或者服务而被我们收集的信息，例如其他用户发布的信息中可能含有您的部分信息（如：在评论、留言、发布图文中涉及到与您相关的信息）。</li>
          <!--        <li>d. 如果您仅希望使用TalexWiki为您提供的基本功能时您可了解并使用基本功能模式。在基本功能模式下，TalexWiki仅为保障软件及服务的安全运行，依据法律法规的相关规定收集您的个人信息，不收集您的其他个人信息。为保证最小必要地收集您的个人信息，您可在浏览模式下（即未登陆状态）下使用我们的产品或服务，且在使用“基本功能模式”时，您仅能使用话题讨论、信息分享和关注互动等基本功能服务。</li>-->
        </ul>
        <h6>1.3.2 互动交流</h6>
        <blockquote>您主动关注您感兴趣的（个人、团队）帐号、维基并与之进行互动，进行浏览、评论、收藏、点赞或分享内容时，我们会收集您关注的帐号，并向您展示您关注帐号发布内容。</blockquote>

        <h5>1.4 搜索</h5>
        <blockquote>您使用"TalexWiki"的搜索服务、云数据（云模板等）时，我们会收集您的搜索关键字信息、日志记录。为了提供高效的搜索服务，部分前述信息会暂时存储在您的本地存储设备之中，并可向您展示搜索结果内容、搜索历史记录。</blockquote>

        <h5>1.5 TalexWiki 商业版申请</h5>
        <blockquote>您申请成为TalexWiki商业版用户时，我们会收集您的真实姓名、联系方式（微信或手机）、当前所在公司、个人简介信息、博客与技术媒体信息，如您未能填写前述信息，可能无法成为TalexWiki商业版用户，但不影响您使用TalexWiki的其他功能。</blockquote>

        <h5>1.6 TalexWiki 学识栏目</h5>
        <blockquote>
          您可以通过"TalexWiki"的学识栏目功能进行线上文档学习、线上文档查阅等活动的报名及使用。由于学识栏目的所有活动和权益仅限学生身份，若您希望使用"TalexWiki"的字学栏目功能，我们需要收集您的姓名、学校名称、学院、在读学历、专业名称、毕业时间、联系邮箱、手机号、学生证封面、学生证个人信息页以及学籍注册页以完成学生身份认证。
          <br />
          在认证的过程中，我们需要您提供的部分信息是个人敏感信息，您可以拒绝提供，且不会影响TalexWiki其他功能的正常使用。这些信息仅供学生认证及法律法规所规定的用途，未经您明示授权，不会用作其他目的。
          <br />
          如果您认为我们不正确地处理了您的个人信息、或您希望取消学生认证，请您通过文末的联系方式及时联系我们处理。
        </blockquote>

        <h5>1.7 实名认证</h5>
        <blockquote>
          在您申请提现或使用其他需实名认证的功能或服务时，为符合法律法规相关要求，保障您或其他用户的安全，或维护功能/服务的安全稳定，需要您提供真实身份信息（真实姓名、身份证件号码，根据实际情况可能有所不同）以完成实名认证。
          <br />
          在实名认证的过程中，可能需要由提供认证服务的第三方认证机构核验您的真实身份信息。这些信息将用于完成实名认证、为您申报个人所得税的目的，或其他法律法规所规定的用途，未经您明示授权不会用作其他目的。您可以拒绝提供，但将可能无法使用必须实名认证才可使用的功能或相关服务。不能使用此类功能或服务，不影响您使用其他功能与服务。
        </blockquote>

        <h5>1.8 其他功能</h5>
        <ul>
          <li>a. 在您分享或接收被分享的信息等情形下，我们需要访问您的剪切板，读取其中包含的链接以实现分享等功能或服务。</li>
          <li>b. 我们可能需要访问您的浏览器信息以便于我们为您展现更合理的页面布局</li>
          <li>c. 我们可能需要访问您的设备信息以便于我们为您展现更合理的页面主题、页面配色（详见 1.9.2）</li>
        </ul>

        <h5>1.9 运营与安全运行/保障</h5>

        <h6>1.9.1 运营与安全保障功能</h6>
        <blockquote>我们致力于为您提供安全、可信的产品与使用环境，提供优质而可靠的服务是我们的核心目标。为了维护我们服务的正常运行，保护您或其他用户或公众的合法利益免受损失，我们会收集用于维护产品或服务安全稳定运行必要信息。</blockquote>

        <h6>1.9.2 设备信息与日志信息</h6>
        <ul>
          <li>a. 为了保障软件与服务的安全运行，运营的质量及效率，我们会收集您的硬件型号、操作系统版本号、设备标识符（Android如IMEI、AndroidID、OAID、IMSI、ICCID、MEID，iOS如IDFV、IDFA；不同的标识符在有效期、是否可由用户重置以及获取方式方面会有所不同）、网络设备硬件地址（MAC地址）、IP地址、蓝牙（Bluetooth）、软件版本号、网络接入方式、类型、状态、网络质量数据、操作、使用、服务日志、设备传感器数据。</li>
          <li>b. 为了预防恶意程序及安全运营所必需，我们会收集安装的应用信息或正在运行的进程信息、应用程序的总体运行、使用情况与频率、应用崩溃情况、总体安装使用情况、性能数据、应用来源。</li>
          <li>c. 我们可能使用您的账户信息、设备信息、服务日志信息以及我们关联公司、合作方在获得您授权或依法可以共享的信息，用于判断账户安全、进行身份验证、检测及防范安全事件。</li>
        </ul>

        <h6>1.10 收集、使用个人信息目的变更</h6>
        <blockquote>请您了解，随着我们业务的发展，可能会对TalexWiki的功能和提供的服务有所调整变化。原则上，当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原处理目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次按照法律法规及国家标准的要求以页面提示、交互流程、协议确认方式另行向您进行告知说明，并征得您的同意。</blockquote>

        <h6>1.11 征得授权同意的例外</h6>
        <blockquote> 请您理解，在下列情形中，根据法律法规及相关国家标准，我们收集和使用您的个人信息不必事先征得您的授权同意：</blockquote>

        <ul>
          <li>a. 与我们履行法律法规规定的义务相关的；</li>
          <li>b. 与国家安全、国防安全直接相关的；</li>
          <li>c. 与公共安全、公共卫生、重大公共利益直接相关的；</li>
          <li>d. 与刑事侦查、起诉、审判和判决执行等直接相关的；</li>
          <li>e. 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；</li>
          <li>f. 您自行向社会公众公开的个人信息；</li>
          <li>g. 从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</li>
          <li>h. 根据个人信息主体要求签订或履行合同所必需的；</li>
          <li>i. 用于维护软件及相关服务的安全稳定运行所必需的，例如发现、处置软件及相关服务的故障；</li>
          <li>j. 为开展合法的新闻报道所必需的；</li>
          <li>k. 学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</li>
          <li>l. 法律法规规定的其他情形。</li>
        </ul>

        <blockquote>特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；当您的信息可以单独或结合其他信息识别到您的个人身份时或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，这些信息在结合使用期间，将作为您的个人信息按照本隐私政策处理与保护。</blockquote>

      </div>

      <!--        2.0-->
      <div>
        <h4>2. 我们如何使用cookie等同类技术</h4>
        <blockquote>Cookie 和同类技术是互联网中普遍使用的技术。当您使用TalexWiki及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个 Cookie 或匿名标识符，以收集和存储您访问、使用本产品时的信息。我们承诺，不会将 Cookie 用于本隐私政策所述目的之外的任何其他用途。我们使用 Cookie 和同类技术主要为了实现以下功能或服务：</blockquote>

        <h5>2.1 保障产品与服务的安全、高效运转</h5>
        <blockquote>我们可能会设置认证与保障安全性的 cookie 或匿名标识符，使我们确认您是否安全登录服务，或者是否遇到盗用、欺诈及其他不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。</blockquote>

        <h5>2.2 帮助您获得更轻松的访问体验</h5>
        <blockquote>使用此类技术可以帮助您省去重复您填写个人信息、输入搜索内容的步骤和流程（示例：记录搜索、表单填写）。</blockquote>

        <h5>2.3 为您推荐、展示、推送您可能感兴趣的内容或帐号</h5>
        <ul>
          <li>a. 我们可能会利用 Cookie 和同类技术了解您的偏好和使用习惯，进行数据分析，以改善产品服务、推荐用户感兴趣的信息或功能。</li>
          <li>b. 在TalexWiki的分享页中，我们可能会使用cookie对浏览活动进行记录，用于向您推荐信息和排查崩溃、延迟的相关异常情况以及探索更好的服务方式。</li>
        </ul>

        <h5>2.4 cookie的清除</h5>
        <blockquote>大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。如您进行清除，可能因为这些修改，您可能无法使用依赖于Cookie由我们提供的服务或相应功能。</blockquote>

      </div>

      <!--        3.0-->
      <div>
        <h4>3. 数据使用过程中涉及的合作方以及转移、公开个人信息</h4>

        <h5>3.1 数据使用过程中涉及的合作方</h5>

        <h6>3.1.1 原则</h6>
        <ul>
          <li>a. 合法原则：与合作方合作过程中涉及数据使用活动的，必须具有合法目的、符合法定的合法性基础。如果合作方使用信息不再符合合法原则，则其不应再使用您的个人信息，或在获得相应合法性基础后再行使用。</li>
          <li>b. 正当与最小必要原则：数据使用必须具有正当目的，且应以达成目的必要为限。</li>
          <li>c. 安全审慎原则：我们将审慎评估合作方数据使用共享信息的目的，对这些合作方的安全保障能力进行综合评估，并要求其遵循合作法律协议。我们会对合作方获取信息的软件工具开发包（SDK）、应用程序接口（API）进行严格的安全监测，以保护数据安全。</li>
        </ul>

        <!--        TODO:  TalexWiki接入合作方目录-->

        <h6>3.1.2 委托处理</h6>
        <blockquote>对于委托处理个人信息的场景，我们会与受托合作方根据法律规定签署相关处理协议，并对其个人信息使用活动进行监督。</blockquote>

        <h6>3.1.3 共同处理</h6>
        <blockquote>对于共同处理个人信息的场景，我们会与合作方根据法律规定签署相关协议并约定各自的权利和义务，确保在使用相关个人信息的过程中遵守法律的相关规定、保护数据安全。</blockquote>

        <h6>3.1.4 合作方的范围</h6>
        <blockquote>若具体功能和场景中涉及由我们的关联方、第三方提供服务，则合作方范围包括我们的关联方与第三方。</blockquote>

        <h6>3.1.5 实现功能或服务的数据使用</h6>
        <ul>
          <li>a. 当您在使用TalexWiki中由我们的合作方提供的功能，或者当软件服务提供商、智能设备提供商、系统服务提供商与我们联合为您提供服务时我们可能会与其使用为实现业务目的所必需的信息，进行综合统计并形成间接人群画像，用以向您推荐、展示或推送您可能感兴趣的信息，或者推送更适合您的特定功能、服务或商业广告。</li>
          <li>b. 基于我们与通信运营商的合作，当您使用TalexWiki"一键登录"功能时，经过您的同意，我们会与运营商使用您的手机号码为您提供快捷的登录服务。拒绝上述使用将导致您无法通过"一键登录"方式注册登录TalexWiki，但不影响您通过其他方式注册登录，也不影响其他功能的正常使用。</li>
          <li>c. 钱包功能：钱包功能中的相关服务由我们的关联方及合作伙伴提供，当您使用钱包相关功能时我们的关联方和合作伙伴会根据功能或服务必需而收集必要限度内的信息。</li>
          <li>d. 支付功能：支付功能由与我们合作的第三方支付机构向您提供服务。第三方支付机构可能需要收集您的姓名、银行卡类型及卡号、有效期及手机号码。银行卡号、有效期及手机号码是个人敏感信息，这些信息是支付功能所必需的信息，拒绝提供将导致您无法使用该功能，但不影响其他功能的正常使用。</li>
          <li>e. 客户服务：为及时处理您的投诉、建议以及其他诉求，客户服务提供商需要使用您的帐号及所投诉事件的相关信息，以及时了解、处理和响应相关问题。</li>
        </ul>

        <h6>3.1.6 实现广告业务的数据使用</h6>
        <ul>
          <li>a. 广告推送与投放：进行推送/推广和广告投放或提供前述服务的合作方使用去标识化或匿名化后的设备、网络、渠道信息以及标签信息；与广告主合作的广告推送/推广、投放/分析服务合作方可能需要使用前述信息，以实现广告投放、优化与提升广告有效触达率。</li>
          <li>b. 广告统计分析：进行推送/推广、广告投放以及提供前述分析服务的合作方可能需要使用您的设备、网络、广告点击、浏览、展示以及广告转化数据等信息用于分析、衡量、提升广告和相关服务的有效性。</li>
          <li>c. 广告合作方对信息的使用：广告合作方可能将上述信息与其合法获取的其他数据相结合，以优化广告投放效果，我们会要求其对信息的使用遵循合法、正当、必要原则，保障用户合法权利不受侵犯。</li>
          <li>d. 广告留资信息：您在广告主或其委托的服务提供方所提供的广告展示页中主动填写您的联系方式、地址等信息时，这些信息可能被广告主直接收集并使用。</li>
        </ul>

        <h6>3.1.7 实现安全与分析统计的共享信息</h6>
        <ul>
          <li>a. 保障使用安全：我们非常重视帐号与服务安全，为保障您和其他用户的帐号与财产安全，使您和我们的正当合法权益免受不法侵害，我们和关联公司或服务提供商可能会共享必要的设备、帐号及日志信息。</li>
          <li>b. 分析产品使用情况：为分析我们服务的使用情况，提升用户使用的体验，我们的合作方可能会需要与产品使用情况（崩溃、闪退），设备标识信息、应用总体安装使用情况等信息。</li>
        </ul>

        <h6>3.1.8 帮助您参加营销推广活动</h6>
        <blockquote>当您选择参加我们及我们的合作方举办的有关营销活动时，为保障您在联合活动中获得体验一致的服务，或委托合作方及时向您兑现奖励，我们与我们的合作方可能需要使用您的姓名、通信地址、联系方式、银行帐号等信息（不同活动中使用的信息可能存在差异，具体以活动规则为准）。拒绝上述使用可能会影响您参加相关活动，但不会影响其他功能。</blockquote>

        <h5>3.2 转移</h5>
        <blockquote>随着我们业务的持续发展，我们将有可能进行合并、收购、资产转让，您的个人信息有可能因此而被转移。在发生前述变更时，我们将按照法律法规及不低于本隐私政策所载明的安全标准要求继受方继续履行个人信息处理者的义务，若继受方变更原先的处理目的、处理方式的我们将要求继受方重新征得您的授权同意。</blockquote>

        <h5>3.3 公开</h5>
        <ul>
          <li>a. 我们不会公开披露您的信息，除非遵循国家法律法规规定或者获得您的同意。我们公开披露您的个人信息会采用符合行业内标准的安全保护措施。</li>
          <li>b. 对违规帐号、欺诈行为进行处罚公告时，我们会披露相关帐号的信息。</li>
          <li>c. 在发布作者贡献排行榜及其他TalexWiki官方评选的榜单时，我们可能会在榜单中披露您个人主页中已公开的信息。</li>
        </ul>

        <h5>3.4 依法豁免征得同意提供、公开披露的个人信息</h5>
        <blockquote>请您理解，在下列情形中，根据法律法规及国家标准，我们向合作方提供、公开披露您的个人信息无需征得您的授权同意：</blockquote>
        <ul>
          <li>a. 为订立、履行您作为一方当事人的合同所必需，或者按照依法制定的劳动规章制度和依法签订的集体合同实施人力资源管理所必需；</li>
          <li>b. 为履行法定职责或者法定义务所必需；</li>
          <li>c. 国家安全、国防安全直接相关的；</li>
          <li>d. 与刑事侦查、起诉、审判和判决执行等直接相关的；</li>
          <li>e. 为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；</li>
          <li>f. 为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；</li>
          <li>g. 依照相关法律规定处理您自行公开或者其他已经合法公开的个人信息；</li>
          <li>h. 从合法公开披露的信息中收集个人信息的；</li>
          <li>i. 法律、行政法规规定的其他情形。</li>
        </ul>
      </div>

      <!--        4.0-->
      <div>
        <h4>4. 我们如何存储个人信息</h4>

        <h5>4.1 存储地点</h5>
        <blockquote>我们依照法律法规的规定，将在境内运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。目前，我们不会将上述信息传输至境外，如果我们向境外传输，我们将会严格遵守中国的相关法律、监管政策，并会遵循相关国家规定或者征求您的同意。</blockquote>

        <h5>4.2 存储期限</h5>
        <blockquote>
          我们仅在为提供TalexWiki及服务之目的所必需的期间内保留您的个人信息，例如：
          <br /><br />
          手机号码：当您使用手机号码注册登录时，我们需要持续保留您的手机号码，以便于向您提供正常的服务、应对您可能的查询和客诉并保障您的账号和系统安全。
          您发布的信息、评论、点赞及相关信息，在您未撤回、删除或未注销帐号期间，我们会保留相关信息用于向您提供持续的业务功能。。
          如果您注销帐户、主动删除个人信息或超出必要的期限后，我们将对您的个人信息进行删除或匿名化处理，但以下情况除外：
          <br /><br />
          遵从法律法规有关信息留存的要求（例如：《电子商务法》规定：商品和服务信息、交易信息保存时间自交易完成之日起不少于三年）。
          出于财务、审计、争议解决等目的需要合理延长期限的。
        </blockquote>

      </div>

      <!--        5.0-->
      <div>
        <h4>5. 我们如何保护个人信息的安全</h4>

        <h5>5.1 我们非常重视您个人信息的安全，将努力采取合理的安全措施（包括技术方面和管理方面）来保护您的个人信息，防止您提供的个人信息被不当使用或未经授权的情况下被访问、公开披露、使用、修改、损坏、丢失或泄漏。</h5>

        <h5>5.2 我们会使用不低于行业同行的加密技术、匿名化处理及相关合理可行的手段保护您的个人信息，并使用安全保护机制防止您的个人信息遭到恶意攻击。</h5>

        <h5>5.3 我们会建立专门的安全部门、安全管理制度、数据安全流程保障您的个人信息安全。我们采取严格的数据使用和访问制度，确保只有授权人员才可访问您的个人信息，并适时对数据和技术进行安全审计。</h5>

        <h5>5.4 尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。</h5>

        <h5>5.5 您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于使用复杂密码、定期修改密码、不将自己的帐号密码及相关个人信息透露给他人。</h5>

        <h5> 5.6 我们会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻止这些安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。我们将及时将事件相关情况以推送通知、邮件、信函、短信及相关形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。</h5>

        <h5>5.7 您一旦离开TalexWiki及相关服务，浏览或使用其他网站、服务及内容资源，我们将没有能力和直接义务保护您在TalexWiki及相关服务之外的软件、网站提交的任何个人信息，无论您登录、浏览或使用上述软件、网站是否基于TalexWiki的链接或引导。</h5>

      </div>

      <!--        6.0-->
      <div>
        <h4>6.个性化推荐</h4>
        <blockquote>为了向您展示、推荐相关性更高的信息和广告，提供更契合您要求的服务，TalexWiki会为您提供个性化推荐服务，以下我们将向您详细说明个性化推荐服务的运行机制以及您实现控制的方式。</blockquote>

        <h5>6.1 个性化推荐的机制</h5>
        <ul>
          <li>a.我们提供个性化推荐服务的范围包括展示资讯、网页、文章等图文或视频内容等。</li>
          <li>b.为了预测您的偏好，我们可能会收集、使用您的设备信息以及在使用产品时的行为信息，行为信息包括您在访问/使用产品时的点击、关注、收藏、搜索、查询、浏览、下载、分享及交易的操作相关记录。我们会对上述信息进行自动分析和计算，系统会根据计算结果自动筛选出您可能更感兴趣的内容进行推送。</li>
          <li>c.我们会根据您在使用产品过程中的浏览行为对推荐模型进行实时反馈，不断调整优化推荐结果，更好地向您提供优质内容。</li>
        </ul>

        <h5>6.2 个性化推荐的控制与管理</h5>

        <h6>6.2.1 接收信息的自主可控</h6>
        <blockquote>我们会利用推荐算法对您浏览的信息内容进行个性化推荐和展示，您可通过下述方式对信息内容的个性化推荐进行控制：</blockquote>

        <ul>
          <li>a. 自主决定接收个性化推送资讯：您可通过“我”-“设置”-“个性化推荐设置”对个性化推荐功能进行开启或关闭，您可以选择一键全部关闭个性化推荐，当您选择关闭全部个性化推荐后，将不再向您展示“推荐”频道，您无法享受个性化推荐服务，但仍可继续浏览关注、热榜、头条精选等非个性化推荐内容。</li>
          <li>b.自主订阅所需的资讯：在关注频道中会根据您主动选择关注的帐号信息进行展示，您可以自主选择关注或取消关注。</li>
        </ul>

      </div>

      <!--        7.0-->
      <div>
        <h4>7.管理您的个人信息</h4>
        <blockquote>我们非常重视您对个人信息的管理，并尽全力保护您对于您个人信息的查阅、复制、更正、补充、删除、撤回同意授权、注销帐号、投诉举报以及设置隐私功能的相关权利，以使您有能力保障您的隐私和信息安全。</blockquote>

        <h5>7.1 改变或撤回授权范围</h5>

        <h6>7.1.1 改变或撤回敏感权限设置</h6>
        <blockquote>您可以在设备本身操作系统中关闭相关权限改变同意范围或撤回您的授权。撤回授权后我们将不再收集与这些权限相关信息。</blockquote>

        <h6>7.1.2 改变或撤回授权的信息处理</h6>
        <blockquote>特定的业务功能和服务将需要您的信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的功能和服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响公司此前基于您的授权而开展的个人信息处理。</blockquote>

        <h5>7.2 您的个人信息权利</h5>

        <h6>7.2.1 查阅、复制个人帐号信息</h6>
        <blockquote>您可以查阅、复制您的头像、用户名、职位、公司、简介、博客地址，您可以在TalexWiki-"我"-点击头像-"编辑"中进行查阅、复制。</blockquote>

        <h6>7.2.2 查阅、更正、取消您关注帐号；查阅访问粉丝、访客信息</h6>
        <ul>
          <li>a. 进入TalexWiki-"我"-点击头像-"关注"，在关注列表中查阅、取消关注您关注的帐号。</li>
          <li>b. 进入TalexWiki-"我"—点击头像—"关注者"，可查阅关注您帐号的关注者帐号信息。</li>
        </ul>

        <h6>7.2.3 查阅、更正您的收藏、点赞、阅读历史记录</h6>
        <ul>
          <li>a. 进入TalexWiki-"我"—"我赞过的"、"收藏集"或"阅读过的文章"进入查阅/更正；</li>
          <li>b. 进入TalexWiki-"我"-"设置"—"缓存管理"，清除缓存信息。</li>
        </ul>

        <h6>7.2.4 删除发布的内容、评论内容</h6>
        <ul>
          <li>a. 删除发布内容：进入TalexWiki-"我"—点击头像-进入"动态"或"专栏"或"沸点"-进入单条内容—点击单条内容右上角"…"符号操作删除；</li>
          <li>b. 删除评论内容：您可通过访问单条评论内容、并通过访问页面删除您的评论、取消您的点赞。</li>
          <li>c. 特别提示您注意，出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法自主修改注册时提交的某些初始注册信息。如您确有需要修改该类注册信息，请根据本隐私政策载明的联系方式联系我们。</li>
        </ul>

        <blockquote>除上述外，如果您或其他有权主体对相关法律法规赋予的个人信息权利的行使，有任何主张、要求或者疑问，您可以通过【登录"TalexWiki"客户端-"我"-"意见反馈"入口或本网站右下角"建议反馈"入口】与我们联系，我们将尽快审核所涉问题，并在验证您的用户身份后的十五个工作日内回复。</blockquote>

        <h5>7.3 注销帐号</h5>
        <blockquote>
          如您想注销您的TalexWiki帐号，您可以通过TalexWiki-"我 - 设置 - 账号设置 - 账号注销"告知注销需求，并按照客服人员要求提供指定材料。我们将会在收到您的申请后及时进行处理，并在15个工作日或法律法规要求的时限内回复您的请求。在您注销帐号前，我们将验证您的个人身份、安全状态、设备信息等。您知悉并理解，注销帐号的行为是不可逆的行为，当您注销帐号后，我们将删除有关您的相关信息或进行匿名化处理，但法律法规另有规定的除外。
          <br /><br />
          有关注销的流程和内容，请参见TalexWiki帐号注销须知 。
        </blockquote>

        <h5>7.4 意见反馈和投诉举报</h5>
        <blockquote>您可按照我们公示的制度进行投诉或举报。如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索（例如：认为我们收集您的个人信息违反法律规定或者双方约定），您可以通过TalexWiki-"我"—"意见反馈"，进入反馈界面与我们联系。我们核查后会及时反馈您的投诉与举报。</blockquote>

        <h5>7.5 访问隐私政策</h5>
        <ul>
          <li>a. 您可以在注册页面，或者在登录个人帐号后，在"我"-"设置"-"关于"页面查看本隐私政策的全部内容或通过网页端查看本隐私政策全部内容。</li>
          <li>b. 请您了解，本隐私政策中所述的TalexWiki及相关服务可能会根据您所使用的手机型号、系统版本、软件应用程序版本、移动客户端等因素而有所不同。最终的产品和服务以您所使用的TalexWiki软件及相关服务为准。</li>
        </ul>

        <h5>7.6 停止运营向您告知</h5>
        <blockquote>如我们停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对所持有的您的个人信息进行删除或匿名化处理。</blockquote>

      </div>

      <!--        8.0-->
      <div>
        <h4>8. 未成年人条款</h4>
        <ul>
          <li>a. 若您是未满18周岁的未成年人，在使用TalexWiki及相关服务前，应在您的父母或其他监护人监护、指导下共同阅读并同意本隐私政策。</li>
          <li>b. 若您是未满14周岁的未成年人的监护人，在使用TalexWiki及相关服务前，应为您的被监护人阅读并同意本隐私政策。</li>
          <li>c. 我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、储存、共享、转让或披露未成年人的个人信息；如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关信息。</li>
          <li>d. 若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过公司本隐私政策公示的联系方式与我们联系。</li>
        </ul>

      </div>

      <!--        9.0-->
      <div>
        <h4>9. 隐私政策的修订和通知</h4>
        <ul>
          <li>a. 为了给您提供更好的服务，TalexWiki及相关服务将不时更新与变化，我们会适时对本隐私政策进行修订，这些修订构成本隐私政策的一部分并具有等同于本隐私政策的效力，未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。</li>
          <li>b. 本隐私政策更新后，我们会在TalexWiki发出更新版本，并在更新后的条款生效前通过官方网站（wiki.talexs.cn）公告或其他适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。</li>
        </ul>
      </div>

      <!--        10.0-->
      <div>
        <h4>10. 联系我们</h4>
        <blockquote> 如对本隐私政策内容有任何疑问、意见或建议，您可通过登录"TalexWiki"客户端-"我"-"意见反馈"入口或本网站右下角"建议反馈"入口与我们联系。</blockquote>
      </div>

    </div>
  </div>
</template>

<script>
export default {
  name: "AboutProtocol"
}
</script>

<style lang="scss" scoped>
blockquote {
  position: relative;
  display: inline-block;
  padding: 15px 12px;

  width: calc(100% - 40px);
}

.main-agreement-content {
  position: relative;
  padding: 2%;
}

.about-agreement-time {
  position: relative;
  display: flex;
  justify-content: space-around;
  .time {
    margin: 5px 0;
    padding: 3px 6px;

    border-radius: 4px;
    background-color: var(--el-fill-color-light);
  }
}
</style>
